{
  "main": {
    "name":"Shine Abraham",
    "description":"I build things for the web",
    "image":"profilepic.jpg",
    "bio":"I’m an engineer trying to solve real world problems using technology. I've worked as a team of one, where I did everything from start to finish as well as on large teams with a specific role. I pride myself in being flexible and keeping an open mind for each project’s best solution.",
    "contactmessage":"My inbox is always open. Whether you have a question or just want to say hi, I'll try my best to get back to you!",
    "email": "shineabraham101@gmail.com",
    "phone": "0091-8157994555",
    "github":"https://github.com/nordicgiant2/react-nice-resume",
    "project":"https://github.com/nordicgiant2/react-nice-resume",
    "address":{
      "street":"Kadavanthra",
      "city":"Kochi",
      "state":"Kerala",
      "zip": "682020"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"https://drive.google.com/file/d/15rIwpxhah9yPqOhlj3CG8QlDBhKn0Qga/view?usp=sharing",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/shineabraham101/",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/shineabraham101/",
        "className":"fa fa-twitter"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/shineabraham/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/shineabraham/",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/shineabraham",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Over the years, I have been very experimental and took up projects which demand vivid variety of skills.",
    "education":[
      {
        "school":"Amal Jyothi college of engineering",
        "degree":"Bachelor of technology - Computer Science",
        "graduated":"August 2019",
        "description":"Participated and won in multiple All Kerala Hackathons. Later got into a Real Time Location Services based startup Agreefy",
        "description1":"Hosted inter college Counter-Strike: GO tournament, Played Center Forward in multiple football tournaments in college ",
        "description2":"Co-founded a service based startup IOdevs and worked with multiple clients to develop websites and android apps in flutter"
      },
      {
        "school":"Indian School Sohar",
        "degree":"My most valuable school experiences weren't academic.",
        "graduated":"March 2015",
        "description":"Head boy of the school, Led and Managed a council of 28 members in organising various school events",
        "description1":"School Football team captain for CBSE Oman Clusters 2013-2015"
      }
    ],
    "work":[
      {
        "company":"Agreefy",
        "title":"Research and Development engineer",
        "years":"July 2019 - Present",
        "description":"Built the product Flux from scratch and scaled it from early MVP to production grade. Flux is one among the four products of the company which uses surveillance cameras to track people at venues and identify their movement pattern. It helps to show insights about the people visiting the venue. Built using Python and AWS. It identifies humans from images/stream received from the surveillance cameras.",
        "description1":"Built and integrated people counting cameras to identify flow of people in crowded venues like malls, exhibition centers, office spaces. The dashboard view gives insight of the flow of people and live people count in and out of the venue.",
        "description2":"Simulated, deployed and integrated Real time location system to track people in venues with nearly 15cm accuracy.",
        "description3":"Built core functionality of tracking vehicles using GPS devices to track vehicles in a fleet and see them live in our dashboard. Integrated GPS tracking, speed and fuel efficiency monitoring, and other basic alerts to manage fleet of vehicles.",
        "description4":"Built and integrated a chatbot to AGREEQ ( Agreefy Queue management system ) so as to enable an easy conversational booking system in websites or mobile apps. Developed the chatbot using opensource chatbot.",
        "description5":"Handled integrations of our product TRACKX with SAP and Oracle EBS enabling easy integrations for clients using SAP or EBS for employee/asset management.",
        "description6":"Helped in building the software architecture for a new product 'Vision' based on digital signage. Also helped building the product in the initial phase, drew wireframes and UI for the product. Took presentations on the increasing demand of digital signage and proposed a business model for the product."        
      },
      {
        "company":"I/Odev",
        "title":"Co-founder and technical team lead",
        "years":"December 2017 - December 2019",
        "description1":"Built a mobile rescue app along with my colleagues at I/O Developers called 'Kerala Rescue' and helped rescue 50+ stranded people from their flooded homes in 2018 Kerala floods",
        "description":"Worked in a team to Build school management mobile app and dashboard for a client based in GCC."
      },
      {
        "company":"Veeras Infotek Private Limited",
        "title":"Intern",
        "years":"Jun 2018 - July 2018",
        "description":"Got a global exposure of the work culture in the GCC. Helped in a lot of realisations in the field of business management. Took presentations and actively communicated with diverse clients as part of relationship building and networking."
      }
    ],
    "skills":[
      {
        "name":"Python",
        "level":"80%"
      },
      {
        "name":"Amazon Web Services",
        "level":"75%"
      },
      {
        "name":"Machine Learning",
        "level":"60%"
      },
      {
        "name":"SQL",
        "level":"75%"
      },
      {
        "name":"Javascript",
        "level":"75%"
      },
      {
        "name":"RTLS integrations",
        "level":"75%"
      },
      {
        "name":"Socket Servers",
        "level":"60%"
      },
      {
        "name":"HTML/CSS",
        "level":"70%"
      },
      {
        "name":"ReactJs",
        "level":"65%"
      },
      {
        "name":"Chatbot Development",
        "level":"65%"
      },
      {
        "name":"Website Development",
        "level":"60%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Agreefy Flux",
        "category":"Agreefy Flux is a multi-technology platform which analyzes activity on your site, making crowd management and indoor wayfinding simple.",
        "image":"flux-img.svg",
        "url":"https://www.agreefy.com/product/flux-best-visitor-counting-solution"
      },
      {
        "title":"Gesture controlled gaming",
        "category":"Operate a game through gestures and movement using OpenCV",
        "image":"shine-gesture-gaming.jpg",
        "url":"https://github.com/shineabraham/GestureGamingControls-Opencv"
      },
      {
        "title":"wrld3d javascript",
        "category":"A dynamic 3D mapping platform for smart cities and buildings, gaming, AR/VR experiences.",
        "image":"Wrld3d-3.jpg",
        "url":"https://github.com/shineabraham/wrld3d"
      },
      {
        "title":"Personal Website",
        "category":"A React based resume website",
        "image":"website.jpg",
        "url":"#"
      }
    ]
  }
}
